tangeai/xiaotai-esp32/lckfb-szpi-esp32s3-tirtc/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# CONFIG_PM_ENABLE is not set

# TiRTC SDK 2.3.0 build contract.
CONFIG_FREERTOS_HZ=1000
# CONFIG_FREERTOS_USE_TRACE_FACILITY is not set
# CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS is not set
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

CONFIG_XIAOTAI_CAPTURE_AGC=y
CONFIG_XIAOTAI_WAKE_CAPTURE_AGC=y
CONFIG_XIAOTAI_CAPTURE_AGC_GAIN_DB=15

# 模板默认把日志和 starter> 命令行放在原生 USB Serial/JTAG。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# 默认硬件基线：ESP32-S3 N16R8。其他 Flash/PSRAM 规格需要同步调整。
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
# Keep the dual-mic AFE hot code and constants off the slower DIO flash bus.
# N16R8 only: the boot copy uses PSRAM, not a larger internal CPU cache.
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
# Match ESP-SR's vector access granularity without reserving a larger cache.
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP is not set
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SR_MN_CN_NONE=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# AIROBOT 320x240 产品界面使用随固件编译的完整基本 CJK 字库。
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_FONT_COMPRESSED=y
# CONFIG_LV_BUILD_EXAMPLES is not set

# Realtime Wi-Fi: no disconnected modem sleep; connected sleep is disabled by
# wifi_manager before start. Keep existing AMPDU/IRAM acceleration explicit.
# The PHY cap is 20 dBm; country, calibration and rate limits still apply.
# CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE is not set
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=20
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
# Extra IRAM optimization costs over 5 KiB of internal memory. Keep the current
# budget for AFE/DMA; do not blindly use bulk-throughput buffer presets.
# CONFIG_ESP_WIFI_EXTRA_IRAM_OPT is not set
# TX stays dynamic so PSRAM does not force sixteen 1.6 KiB static TX buffers.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# 平台 HTTP/MQTT、TiRTC 和证书校验所需网络/TLS 能力。
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_AES_C=y
CONFIG_MBEDTLS_DES_C=y
CONFIG_MBEDTLS_SHA1_C=y
CONFIG_MBEDTLS_ECP_C=y
CONFIG_MBEDTLS_ECDH_C=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
